##  데이터 입출력
- csv, excel, html, json, hdf5, sas, stata, sql

In [1]:
import pandas as pd
import numpy as np

In [5]:
# 매직 명령어

In [10]:
%%writefile sample.csv
no, score, name
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample.csv

In [11]:
# csv 파일 읽기
pd.read_csv('sample.csv')

   no   score    name
0   1    1.11     one
1   2    2.22     two
2   3    3.33   three

In [12]:
%%writefile sample1.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

In [14]:
pd.read_csv('sample1.csv', header=None)

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [15]:
pd.read_csv('sample1.csv', names=['c1', 'c2', 'c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [16]:
pd.read_csv('sample.csv', index_col='no')

     score    name
no
1     1.11     one
2     2.22     two
3     3.33   three

In [17]:
%%writefile sample2.txt
c1    c2    c3    c4
0.179187 -1.538472 1.347553 0.43381
1.179187 -2.538472 1.357553 0.43382
2.179187 -3.538472 1.367553 0.43383
3.179187 -4.538472 1.377553 0.43384
4.179187 -5.538472 1.387553 0.43385

Writing sample2.txt

In [19]:
pd.read_csv('sample2.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179187 -1.538472  1.347553  0.43381
1  1.179187 -2.538472  1.357553  0.43382
2  2.179187 -3.538472  1.367553  0.43383
3  3.179187 -4.538472  1.377553  0.43384
4  4.179187 -5.538472  1.387553  0.43385

In [20]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

## 데이터프레임 고급 인덱싱

In [21]:
# loc : 라벨값 기준으로 인덱싱, df.loc[행 인덱스 라벨] or df.loc[행 인덱스 라벨, 열 인덱스 라벨]
# iloc : 정수 기반의 인덱싱

In [24]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), index = ['a', 'b', 'c'],
                  columns = ['one', 'two', 'three', 'four'])

In [25]:
df.loc['b']

one      14
two      15
three    16
four     17
Name: b, dtype: int32

In [28]:
df.loc['b':'c']

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [29]:
df['b':'c']

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [31]:
df.loc[['a','c']]

   one  two  three  four
a   10   11     12    13
c   18   19     20    21

In [32]:
df['one']

a    10
b    14
c    18
Name: one, dtype: int32

In [33]:
df.one

a    10
b    14
c    18
Name: one, dtype: int32

In [34]:
df.one > 15

a    False
b    False
c     True
Name: one, dtype: bool

In [35]:
df[df.one > 15]

   one  two  three  four
c   18   19     20    21

In [36]:
def select_row(df):
    return df.one > 15

In [37]:
select_row(df)

a    False
b    False
c     True
Name: one, dtype: bool

In [38]:
df[select_row(df)]

   one  two  three  four
c   18   19     20    21

### 인덱싱을 이용해서 행과 열 모두 추출하는 경우

In [40]:
df2 = pd.DataFrame(np.arange(10, 22).reshape(3, 4), index = [0, 1, 2],
                  columns = ['A', 'B', 'C', 'D'])

In [41]:
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [42]:
df2.loc[0, 'A']

10

In [43]:
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [44]:
df.loc['b', 'two']

15

In [45]:
df.loc['b':, 'one']

b    14
c    18
Name: one, dtype: int32

In [46]:
df.loc['a', :]

one      10
two      11
three    12
four     13
Name: a, dtype: int32

In [47]:
df.loc[['a', 'b'], ['two', 'four']]

   two  four
a   11    13
b   15    17

In [48]:
df.loc[df.one > 10, ['three', 'four']]

   three  four
b     16    17
c     20    21

#### iloc 인덱싱

In [49]:
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [50]:
df.iloc[0, 1]

11

In [51]:
df.iloc[:2, 2]

a    12
b    16
Name: three, dtype: int32

In [53]:
df.iloc[0, -2:]

three    12
four     13
Name: a, dtype: int32

In [55]:
df.iloc[2, 1:3]

two      19
three    20
Name: c, dtype: int32

In [56]:
df.iloc[-1]

one      18
two      19
three    20
four     21
Name: c, dtype: int32

In [57]:
df.iloc[-1] = df.iloc[-1] * 2
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   36   38     40    42

#### 모든 행과 열에 라벨을 가지고 있는 5행 5열 이상의 크기를 가지는 데이터프레임을 생성하시오.
#### 10가지 이상의 방법을 이용하여 특정 행 또는 열 또는 행과 열을 추출하는 작업을 수행하시오.

In [60]:
df = pd.DataFrame(np.arange(1,26).reshape(5,5), index = ['a', 'b', 'c', 'd', 'e'],
                  columns = ['one', 'two', 'three', 'four', 'five'])
df

   one  two  three  four  five
a    1    2      3     4     5
b    6    7      8     9    10
c   11   12     13    14    15
d   16   17     18    19    20
e   21   22     23    24    25

In [61]:
df.iloc[0]

one      1
two      2
three    3
four     4
five     5
Name: a, dtype: int32

In [62]:
df.iloc[:,4]

a     5
b    10
c    15
d    20
e    25
Name: five, dtype: int32

In [63]:
df.iloc[[2,4], :]

   one  two  three  four  five
c   11   12     13    14    15
e   21   22     23    24    25

In [64]:
df.iloc[2:, [1,3]]

   two  four
c   12    14
d   17    19
e   22    24

In [65]:
df.iloc[:1, :2]

   one  two
a    1    2

In [66]:
df.iloc[-1]

one      21
two      22
three    23
four     24
five     25
Name: e, dtype: int32

In [67]:
df.iloc[-2,2]

18

In [68]:
df.loc['a']

one      1
two      2
three    3
four     4
five     5
Name: a, dtype: int32

In [70]:
df.one

a     1
b     6
c    11
d    16
e    21
Name: one, dtype: int32

In [71]:
df.four

a     4
b     9
c    14
d    19
e    24
Name: four, dtype: int32

In [73]:
df.loc['b':,'three']

b     8
c    13
d    18
e    23
Name: three, dtype: int32

## 데이터 조작

In [74]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [75]:
s.count()

9

In [76]:
np.random.seed(2)

In [79]:
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2, 3]=np.nan
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      float64
 1   1       4 non-null      float64
 2   2       4 non-null      float64
 3   3       3 non-null      float64
dtypes: float64(4)
memory usage: 256.0 bytes

In [81]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [82]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [84]:
# 데이터 내용 미리보기 : head() or tail()
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [85]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [83]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [86]:
titanic.shape

(891, 15)

In [87]:
titanic.ndim

2

In [88]:
# 도수분포 value_counts - 시리즈 타입
titanic['embarked'].value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [89]:
titanic['embark_town'].value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

### 정렬
- sort_index()
- sort_values()

In [ ]:
titanic['pclass'].value_counts().sort_index()

In [90]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [91]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [92]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [93]:
df[0].value_counts()

3.0    1
2.0    1
4.0    1
0.0    1
Name: 0, dtype: int64

In [94]:
df[3].value_counts()

1.0    1
0.0    1
2.0    1
Name: 3, dtype: int64

In [95]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [96]:
df.sort_values(by=2)

     0    1    2    3
2  4.0  3.0  1.0  NaN
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
3  0.0  4.0  4.0  2.0

In [98]:
df.sort_values(by=[1, 2], ascending=False)

     0    1    2    3
3  0.0  4.0  4.0  2.0
1  2.0  4.0  3.0  0.0
0  3.0  3.0  2.0  1.0
2  4.0  3.0  1.0  NaN

#### titanic 데이터셋을 이용하여 승객의 성별 인원수, 나이별 인원수, 객실별 인원수, 사망/생존 인원수 추출
- sort_values() 메서드를 이용할 것

In [104]:
titanic.sort_values(by=['survived'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
519,0,3,male,32.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
521,0,3,male,22.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
522,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
524,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
546,1,2,female,19.0,1,0,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
215,1,1,female,31.0,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
216,1,3,female,27.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
218,1,1,female,32.0,0,0,76.2917,C,First,woman,False,D,Cherbourg,yes,True
445,1,1,male,4.0,0,2,81.8583,S,First,child,False,A,Southampton,yes,False

In [111]:
titanic.groupby(by=['sex','alive'])[['survived']].count()

              survived
sex    alive
female no           81
       yes         233
male   no          468
       yes         109

In [112]:
titanic.groupby(by=['age','alive'])[['survived']].count()

             survived
age   alive
0.42  yes           1
0.67  yes           1
0.75  yes           2
0.83  yes           2
0.92  yes           1
...               ...
70.00 no            2
70.50 no            1
71.00 no            2
74.00 no            1
80.00 yes           1

[142 rows x 1 columns]

In [115]:
titanic.groupby(by='age')['age'].count()

age
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Name: age, Length: 88, dtype: int64

In [116]:
titanic.groupby(by=['pclass','alive'])[['survived']].count()

              survived
pclass alive
1      no           80
       yes         136
2      no           97
       yes          87
3      no          372
       yes         119

In [117]:
df2.sum(axis=1)

0    46
1    62
2    78
dtype: int64

In [118]:
df2['rowSum'] = df2.sum(axis=1)
df2

    A   B   C   D  rowSum
0  10  11  12  13      46
1  14  15  16  17      62
2  18  19  20  21      78

### 연습문제
1. 타이타닉호의 승객들의 평균 나이를 추출하시오.
2. 타이타닉호의 승객중 여성 승객의 평균 나이를 추출하시오.
3. 타이타닉호에 승객중 1등실에 탑승한 여성 승객의 평균 나이를 추출하시오.

In [123]:
titanic.age.mean()

29.69911764705882

In [125]:
titanic.groupby(by=['sex'])[['age']].mean()

              age
sex
female  27.915709
male    30.726645

In [126]:
titanic.groupby(by=['pclass', 'sex'])[['age']].mean()

                     age
pclass sex
1      female  34.611765
       male    41.281386
2      female  28.722973
       male    30.740707
3      female  21.750000
       male    26.507589

#### apply 함수
- 행이나 열에 함수를 반복적으로 처리하는 함수
- 람다(lambda) 함수 : 익명의 함수
- 형식 : lambda 입력:출력

In [127]:
# 두 수를 입력받아 합을 계산하는 함수
def hap(x, y):
    return x + y

In [128]:
hap(10,20)

30

In [ ]:
# 람다 형식으로 표현하려면
(lambda x,y : x + y)(10,20)

#### map(함수, 리스트)

In [134]:
list(map((lambda x : x**2), range(5)))

[0, 1, 4, 9, 16]

In [143]:
df3 = pd.DataFrame(np.random.randint(6,size = 15).reshape(5,3), columns = ['A', 'B', 'C'])

In [144]:
df3

   A  B  C
0  0  2  3
1  1  2  4
2  4  2  2
3  0  1  2
4  2  0  5

In [146]:
# 각 열에 최대값과 최소값의 차이를 구하시오
df3.apply(lambda x : x.max() - x.min())

A    4
B    2
C    3
dtype: int64

In [145]:
# 각 행에 최대값과 최소값의 차이를 구하시오.
df3.apply(lambda x : x.max() - x.min(), axis=1)

0    3
1    3
2    2
3    2
4    5
dtype: int64

In [148]:
# 각 열에 값들의 건수를 찾으시오
df3.apply(pd.value_counts, axis=0)

     A    B    C
0  2.0  1.0  NaN
1  1.0  1.0  NaN
2  1.0  3.0  2.0
3  NaN  NaN  1.0
4  1.0  NaN  1.0
5  NaN  NaN  1.0

In [154]:
# 타이타닉호의 승객 중 나이가 20살을 기준으로 성인(Adult)과 미성년자(Child)를 구별하여 파생변수
# adult/child에 담는 작업을 수행하시오.

titanic['adult/child'] = titanic.apply(lambda x : 'adult' if x.age >= 20 else 'child', axis = 1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

In [155]:
titanic.apply(lambda x : 'adult' if x.age >= 20 else 'child', axis = 1)

0      adult
1      adult
2      adult
3      adult
4      adult
       ...
886    adult
887    child
888    child
889    adult
890    adult
Length: 891, dtype: object

In [ ]:
def adult_child(df):
    if df.age >= 20:
        'adult'
    else:
        'child'

####  fillna()
- NaN 값을 원하는 값으로 대체하는 함수

In [156]:
df3

   A  B  C
0  0  2  3
1  1  2  4
2  4  2  2
3  0  1  2
4  2  0  5

In [157]:
df3.apply(pd.value_counts)

     A    B    C
0  2.0  1.0  NaN
1  1.0  1.0  NaN
2  1.0  3.0  2.0
3  NaN  NaN  1.0
4  1.0  NaN  1.0
5  NaN  NaN  1.0

In [159]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
0  2.0  1.0  0.0
1  1.0  1.0  0.0
2  1.0  3.0  2.0
3  0.0  0.0  1.0
4  1.0  0.0  1.0
5  0.0  0.0  1.0

#### 타이타닉호의 승객의 나이중 NaN으로 나이가 명시되지 않은 고객의 나이를 평균 나이값으로 대체하는 작업을 수행하시오.

In [162]:
titanic.age = titanic.age.fillna(titanic.age.mean())

In [163]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  adult/child  891 non-null    object
dtypes: bool(2), category(2), float64(2), int64(4), object(6)
memory usage: 87.6+ KB

#### astype(): 자료형을 바꾸는 함수

In [164]:
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
0  2  1  0
1  1  1  0
2  1  3  2
3  0  0  1
4  1  0  1
5  0  0  1

#### 데이터프레임의 인덱스 설정 및 제거
- set_index : 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정
- reset_index : 기존의 행 인덱스를 제거하고 인덱스를 데이터 열로 추가

In [167]:
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3,5), 2)]).T,
                   columns=['C1', 'C2', 'C3', 'C4'])
df1

  C1    C2    C3    C4
0  A  0.07  0.12  0.86
1  B  0.76  0.02  0.54
2  C  0.75  0.03  0.55
3  D  0.92  0.03  0.84
4  E  0.71  0.25  0.12

In [168]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.07  0.12  0.86
B   0.76  0.02  0.54
C   0.75  0.03  0.55
D   0.92  0.03  0.84
E   0.71  0.25  0.12

In [169]:
df2.set_index('C2')

        C3    C4
C2
0.07  0.12  0.86
0.76  0.02  0.54
0.75  0.03  0.55
0.92  0.03  0.84
0.71  0.25  0.12

In [171]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.07  0.12  0.86
1  B  0.76  0.02  0.54
2  C  0.75  0.03  0.55
3  D  0.92  0.03  0.84
4  E  0.71  0.25  0.12

In [172]:
df2.reset_index(drop=True)

     C2    C3    C4
0  0.07  0.12  0.86
1  0.76  0.02  0.54
2  0.75  0.03  0.55
3  0.92  0.03  0.84
4  0.71  0.25  0.12

#### 다중 인덱스

In [173]:
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                  columns = [['A', 'A', 'B', 'B'],
                            ['C1', 'C2', 'C1', 'C2']])

In [174]:
df3

      A           B
     C1    C2    C1    C2
0  0.63 -1.61  0.06  0.46
1  0.68 -0.60  1.00 -0.31
2  0.37  1.61 -0.24 -0.34
3  0.49  1.74  0.07  0.47
4 -0.65 -0.78 -0.78  0.62

In [177]:
df3.columns.names = ['Cidx1', 'Cidx2']
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      0.63 -1.61  0.06  0.46
1      0.68 -0.60  1.00 -0.31
2      0.37  1.61 -0.24 -0.34
3      0.49  1.74  0.07  0.47
4     -0.65 -0.78 -0.78  0.62

In [176]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [181]:
df4 = pd.DataFrame(np.round(np.random.randn(6,4), 2), columns = [['A', 'A', 'B', 'B'],['C', 'C', 'D', 'D']],
                  index = [['M', 'M', 'M', 'F', 'F', 'F'],['id_' + str(i + 1) for i in range(3)]*2])
df4

           A           B
           C     C     D     D
M id_1 -0.09 -0.17 -0.54  0.54
  id_2  0.39  2.21 -0.16  0.29
  id_3  0.11 -0.20  0.23  0.16
F id_1  0.59 -1.35  0.83  0.11
  id_2 -1.24  1.60  2.47 -0.33
  id_3  0.78  0.09 -0.19  0.74

In [178]:
['id_' + str(i + 1) for i in range(3)] * 2

['id_1', 'id_2', 'id_3', 'id_1', 'id_2', 'id_3']

In [180]:
np.round(np.random.randn(6,4), 2)

array([[ 0.43,  0.07, -0.45,  0.6 ],
       [ 2.39, -0.12, -0.32,  0.31],
       [ 2.46, -0.32, -1.82,  0.68],
       [ 0.03,  0.2 ,  0.91, -2.13],
       [ 0.82,  1.18, -0.2 , -0.11],
       [ 1.41, -1.42,  0.67, -0.77]])

In [182]:
df4.columns.names = ['Cidx1', 'Cidx2']
df4.index.names = ['Idx1', 'Idx2']
df4

Cidx1         A           B
Cidx2         C     C     D     D
Idx1 Idx2
M    id_1 -0.09 -0.17 -0.54  0.54
     id_2  0.39  2.21 -0.16  0.29
     id_3  0.11 -0.20  0.23  0.16
F    id_1  0.59 -1.35  0.83  0.11
     id_2 -1.24  1.60  2.47 -0.33
     id_3  0.78  0.09 -0.19  0.74

In [183]:
# 행인덱스와 열인덱스 교환
## stack() : 열인덱스 => 행인덱스
## unstack() : 행인덱스 => 열인덱스
df4.stack("Cidx1")

Cidx2               C     D
Idx1 Idx2 Cidx1
M    id_1 A     -0.09 -0.54
          B     -0.17  0.54
     id_2 A      0.39 -0.16
          B      2.21  0.29
     id_3 A      0.11  0.23
          B     -0.20  0.16
F    id_1 A      0.59  0.83
          B     -1.35  0.11
     id_2 A     -1.24  2.47
          B      1.60 -0.33
     id_3 A      0.78 -0.19
          B      0.09  0.74

In [184]:
df4.stack(1)

Cidx1               A     B
Idx1 Idx2 Cidx2
M    id_1 C     -0.09 -0.54
          D     -0.17  0.54
     id_2 C      0.39 -0.16
          D      2.21  0.29
     id_3 C      0.11  0.23
          D     -0.20  0.16
F    id_1 C      0.59  0.83
          D     -1.35  0.11
     id_2 C     -1.24  2.47
          D      1.60 -0.33
     id_3 C      0.78 -0.19
          D      0.09  0.74

In [185]:
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      0.63 -1.61  0.06  0.46
1      0.68 -0.60  1.00 -0.31
2      0.37  1.61 -0.24 -0.34
3      0.49  1.74  0.07  0.47
4     -0.65 -0.78 -0.78  0.62

In [186]:
# 다중 인덱스를 가지고 있는 경우에 인덱스 값이 하나의 라벨이나 숫자가 아니라 튜플로 둘러싸야야한다.
df3[('B', 'C1')]

0    0.06
1    1.00
2   -0.24
3    0.07
4   -0.78
Name: (B, C1), dtype: float64

In [187]:
# iloc 인덱서를 사용할 경우에는 튜플 형태의 다중 인덱스를 사용할 수 없다.
df3.iloc[0, 2]

0.06

In [188]:
df4

Cidx1         A           B
Cidx2         C     C     D     D
Idx1 Idx2
M    id_1 -0.09 -0.17 -0.54  0.54
     id_2  0.39  2.21 -0.16  0.29
     id_3  0.11 -0.20  0.23  0.16
F    id_1  0.59 -1.35  0.83  0.11
     id_2 -1.24  1.60  2.47 -0.33
     id_3  0.78  0.09 -0.19  0.74

In [189]:
df4.loc[('M', 'id_1'), ('A', 'C')]

Cidx1  Cidx2
A      C       -0.09
       C       -0.17
Name: (M, id_1), dtype: float64

### 데이터 프레임 합성 : merge, concatenate

In [191]:
df1 = pd.DataFrame({
    '고객번호':[1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '고객이름':['고둘리','도우너','그냥또치','고길동','고희동','마이콜','고영희']})
df1

   고객번호  고객이름
0  1001   고둘리
1  1002   도우너
2  1003  그냥또치
3  1004   고길동
4  1005   고희동
5  1006   마이콜
6  1007   고영희

In [193]:
df2 = pd.DataFrame({
    '고객번호':[1001,1001,1005,1006,1007,1001],
    '예금금액':[10000, 20000, 15000, 500, 100000, 30000]
})
df2

   고객번호    예금금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006     500
4  1007  100000
5  1001   30000

In [194]:
# inner join
pd.merge(df1, df2)

   고객번호 고객이름    예금금액
0  1001  고둘리   10000
1  1001  고둘리   20000
2  1001  고둘리   30000
3  1005  고희동   15000
4  1006  마이콜     500
5  1007  고영희  100000

In [195]:
# outer join
pd.merge(df1, df2, how='outer')

   고객번호  고객이름      예금금액
0  1001   고둘리   10000.0
1  1001   고둘리   20000.0
2  1001   고둘리   30000.0
3  1002   도우너       NaN
4  1003  그냥또치       NaN
5  1004   고길동       NaN
6  1005   고희동   15000.0
7  1006   마이콜     500.0
8  1007   고영희  100000.0

In [196]:
pd.merge(df1, df2, how = 'left')

   고객번호  고객이름      예금금액
0  1001   고둘리   10000.0
1  1001   고둘리   20000.0
2  1001   고둘리   30000.0
3  1002   도우너       NaN
4  1003  그냥또치       NaN
5  1004   고길동       NaN
6  1005   고희동   15000.0
7  1006   마이콜     500.0
8  1007   고영희  100000.0

In [197]:
pd.merge(df1, df2, how = 'right')

   고객번호 고객이름    예금금액
0  1001  고둘리   10000
1  1001  고둘리   20000
2  1005  고희동   15000
3  1006  마이콜     500
4  1007  고영희  100000
5  1001  고둘리   30000

In [198]:
# join 메서드
df1.join(df2, how = 'outer')

ValueError: columns overlap but no suffix specified: Index(['고객번호'], dtype='object')

### concat 함수
- 기준열을 사용하지 않고 단순히 데이터를 연결하는 방식

In [199]:
s1 = pd.Series([0, 1], index = ['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])

In [200]:
s1

A    0
B    1
dtype: int64

In [201]:
s2

A    2
B    3
C    4
dtype: int64

In [202]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [206]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                  index = list('ab'),
                   columns = ['데이터1', '데이터2'])
df1

ValueError: Shape of passed values is (3, 2), indices imply (2, 2)

In [207]:
df2 = pd.DataFrame(np.arange(4).reshape(2, 2),
                  index = list('ab'),
                   columns = ['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     0     1
b     2     3

In [208]:
pd.concat([df1, df2], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   0.0   1.0
b     2     3   2.0   3.0
c     4     5   NaN   NaN

In [213]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}

df1 = pd.DataFrame(data, columns=data.keys())
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [ ]:
# pivot(행인덱스로 사용할 열이름, 열인덱스로 사용할 열이름, 데이터로 사용할 열이름)
df1.pivot

### 그룹분석 : groupby()
- size, count : 그룹 데이터의 개수
- mean, median, min, max
- sum, prod, std, var, quantile
- first, last
- agg, aggregate
- describe
- apply
- transform

In [214]:
df2 = pd.DataFrame({'key1':list('AABBA'),
                   'key2':['one', 'two', 'one', 'two', 'one'],
                   'data1':[1, 2, 3, 4, 5],
                   'data2':[10, 20, 30, 40, 50]})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [216]:
# 그룹설정
groups = df2.groupby(df2.key1)
groups

In [217]:
groups.groups # 그룹화한 것들의 인덱스가 저장되어 있다.

{'A': [0, 1, 4], 'B': [2, 3]}

In [218]:
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [215]:
# A그룹과 B그룹의 데이터들의 합계를 구하시오.
df2.groupby(by='key1').sum()

      data1  data2
key1
A         8     80
B         7     70

In [219]:
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [220]:
df2.data1

0    1
1    2
2    3
3    4
4    5
Name: data1, dtype: int64

In [221]:
df2.groupby(df2.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [222]:
df2.groupby(df2.key1).sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

In [224]:
df2.data1.groupby([df2.key1, df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64